# Data Grouping and Aggregation In Pandas

## Data Grouping: 'groupby'

#### The purpose of pivot tables for reporting and data visualization is to analyze the data based on certain grouping mechanics mthe pandas 'groupby' method will serve this purpose with high demand.

In [1]:
import pandas as pd
import numpy as np

In [2]:
pd.DataFrame.groupby?

In [3]:
marks = pd.DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a', 'a'],
                      'key2' : ['one', 'two', 'one', 'two', 'one', 'one'],
                     'data1' : np.arange(10, 16),
                     'data2' : np.arange(16, 22)})
marks

  key1 key2  data1  data2
0    a  one     10     16
1    a  two     11     17
2    b  one     12     18
3    b  two     13     19
4    a  one     14     20
5    a  one     15     21

In [4]:
marks['data1']

0    10
1    11
2    12
3    13
4    14
5    15
Name: data1, dtype: int32

In [5]:
grouped = marks['data1'].groupby(by=marks['key1'])
grouped

In [6]:
grouped.mean()

key1
a    12.5
b    12.5
Name: data1, dtype: float64

In [ ]:
print('a mean:', (10 + 11 + 14 + 15) / 4)
print('b mean:', (12 + 13)/2)

In [7]:
grouped.sum()

key1
a    50
b    25
Name: data1, dtype: int32

In [8]:
group_tk = marks['data1'].groupby(by=[marks['key1'], marks['key2']])
group_tk

In [9]:
print(marks)
print()
print('result:', group_tk.mean())

  key1 key2  data1  data2
0    a  one     10     16
1    a  two     11     17
2    b  one     12     18
3    b  two     13     19
4    a  one     14     20
5    a  one     15     21

result: key1  key2
a     one     13
      two     11
b     one     12
      two     13
Name: data1, dtype: int32

In [ ]:
print((10 + 14 +15)/3)

In [10]:
group_tk.mean().unstack()

key2  one  two
key1
a      13   11
b      12   13

In [11]:
feedb = np.array(['good', 'avg', 'good', 'avg', 'good', 'avg'])
actual = np.array(['good', 'med', 'good', 'med', 'good', 'med'])
mean1 = marks['data1'].groupby(by=[feedb, actual]).mean()
mean1

avg   med     13
good  good    12
Name: data1, dtype: int32

In [12]:
mean_df = marks.groupby(by=['key1']).mean()
mean_df

      data1  data2
key1
a      12.5   18.5
b      12.5   18.5

In [13]:
print(marks)
print()
marks.groupby(by=['key1', 'key2']).size()

  key1 key2  data1  data2
0    a  one     10     16
1    a  two     11     17
2    b  one     12     18
3    b  two     13     19
4    a  one     14     20
5    a  one     15     21

key1  key2
a     one     3
      two     1
b     one     1
      two     1
dtype: int64

#### How To Iterate Over Groups?

In [14]:
marks

  key1 key2  data1  data2
0    a  one     10     16
1    a  two     11     17
2    b  one     12     18
3    b  two     13     19
4    a  one     14     20
5    a  one     15     21

In [15]:
marks.groupby(by='key1')

In [16]:
for key_name, group_name in marks.groupby(by='key1'):
    print(key_name)
    print(group_name)
    print(type(key_name))
    print(type(group_name))

a
  key1 key2  data1  data2
0    a  one     10     16
1    a  two     11     17
4    a  one     14     20
5    a  one     15     21
<class 'str'>
<class 'pandas.core.frame.DataFrame'>
b
  key1 key2  data1  data2
2    b  one     12     18
3    b  two     13     19
<class 'str'>
<class 'pandas.core.frame.DataFrame'>

In [17]:
for (k1_name, k2_name), group_name in marks.groupby(by=['key1', 'key2']):
    print(k1_name, k2_name)
    print(group_name)

a one
  key1 key2  data1  data2
0    a  one     10     16
4    a  one     14     20
5    a  one     15     21
a two
  key1 key2  data1  data2
1    a  two     11     17
b one
  key1 key2  data1  data2
2    b  one     12     18
b two
  key1 key2  data1  data2
3    b  two     13     19

In [18]:
for (k1_name, k2_name), group_name in marks.groupby(by=['data1', 'data2']):
    print(k1_name, k2_name)
    print(group_name)

10 16
  key1 key2  data1  data2
0    a  one     10     16
11 17
  key1 key2  data1  data2
1    a  two     11     17
12 18
  key1 key2  data1  data2
2    b  one     12     18
13 19
  key1 key2  data1  data2
3    b  two     13     19
14 20
  key1 key2  data1  data2
4    a  one     14     20
15 21
  key1 key2  data1  data2
5    a  one     15     21

In [19]:
marks.dtypes

key1     object
key2     object
data1     int32
data2     int32
dtype: object

In [20]:
grouped = marks.groupby(marks.dtypes, axis=1)
for datatype, group in grouped:
    print(datatype)
    print(group)

int32
   data1  data2
0     10     16
1     11     17
2     12     18
3     13     19
4     14     20
5     15     21
object
  key1 key2
0    a  one
1    a  two
2    b  one
3    b  two
4    a  one
5    a  one

#### Column Selection For Aggregation via 'groupby'

In [21]:
print(marks['data1']); print(marks[['data1', 'data2']])

0    10
1    11
2    12
3    13
4    14
5    15
Name: data1, dtype: int32
   data1  data2
0     10     16
1     11     17
2     12     18
3     13     19
4     14     20
5     15     21

In [22]:
sk_g = marks['data1'].groupby(by=marks['key1'])
dk_g = marks[['data1', 'data2']].groupby(by=marks['key2'])
sk_g
dk_g

In [ ]:
print(sk_g.sum())
print(dk_g.sum())

In [23]:
sk_g = marks.groupby(by='key1')['data1'] 
dk_g = marks.groupby(by='key2')[['data1', 'data2']]   
print(sk_g.sum())
print(dk_g.sum())

key1
a    50
b    25
Name: data1, dtype: int32
      data1  data2
key2
one      51     75
two      24     36

#### How To Group With Dictionaries and Series?

In [24]:
rmlist = pd.DataFrame(np.random.randn(4, 5),
                       columns=['a', 'b', 'c', 'd', 'e'],
                       index=['one', 'two', 'three', 'four'])
rmlist

              a         b         c         d         e
one    0.305572 -0.476113  1.842914 -0.592494 -0.907171
two    0.661533 -0.612415  0.807240 -0.232410 -0.108603
three  0.543250 -0.435867  0.944511 -1.449916 -1.729965
four   0.204364  1.385551  1.143722 -0.420559 -1.374570

In [25]:
dic_map = {'a': 'red', 'b': 'red', 'c': 'blue', 'd': 'blue', 'e': 'red', 'f' : 'orange'}
dic_map

{'a': 'red', 'b': 'red', 'c': 'blue', 'd': 'blue', 'e': 'red', 'f': 'orange'}

In [26]:
g_column = rmlist.groupby(by=dic_map, axis=1)
g_column

In [27]:
g_column.sum()

           blue       red
one    1.250420 -1.077712
two    0.574831 -0.059485
three -0.505405 -1.622582
four   0.723163  0.215345

In [28]:
s_map = pd.Series(dic_map)

In [29]:
g_column = rmlist.groupby(by=s_map, axis=1)
g_column.sum()

           blue       red
one    1.250420 -1.077712
two    0.574831 -0.059485
three -0.505405 -1.622582
four   0.723163  0.215345

#### How To Group With Functions?

In [30]:
print(rmlist)
rmlist.groupby(len).sum()

              a         b         c         d         e
one    0.305572 -0.476113  1.842914 -0.592494 -0.907171
two    0.661533 -0.612415  0.807240 -0.232410 -0.108603
three  0.543250 -0.435867  0.944511 -1.449916 -1.729965
four   0.204364  1.385551  1.143722 -0.420559 -1.374570

          a         b         c         d         e
3  0.967105 -1.088528  2.650155 -0.824904 -1.015774
4  0.204364  1.385551  1.143722 -0.420559 -1.374570
5  0.543250 -0.435867  0.944511 -1.449916 -1.729965

In [31]:
key_list = ['one', 'one', 'one', 'two']
print(rmlist)
rmlist.groupby([len, key_list]).sum()

              a         b         c         d         e
one    0.305572 -0.476113  1.842914 -0.592494 -0.907171
two    0.661533 -0.612415  0.807240 -0.232410 -0.108603
three  0.543250 -0.435867  0.944511 -1.449916 -1.729965
four   0.204364  1.385551  1.143722 -0.420559 -1.374570

              a         b         c         d         e
3 one  0.967105 -1.088528  2.650155 -0.824904 -1.015774
4 two  0.204364  1.385551  1.143722 -0.420559 -1.374570
5 one  0.543250 -0.435867  0.944511 -1.449916 -1.729965

In [32]:
key_list = ['one', 'two', 'three', 'four']
print(rmlist)
rmlist.groupby([len, key_list]).sum()

              a         b         c         d         e
one    0.305572 -0.476113  1.842914 -0.592494 -0.907171
two    0.661533 -0.612415  0.807240 -0.232410 -0.108603
three  0.543250 -0.435867  0.944511 -1.449916 -1.729965
four   0.204364  1.385551  1.143722 -0.420559 -1.374570

                a         b         c         d         e
3 one    0.305572 -0.476113  1.842914 -0.592494 -0.907171
  two    0.661533 -0.612415  0.807240 -0.232410 -0.108603
4 four   0.204364  1.385551  1.143722 -0.420559 -1.374570
5 three  0.543250 -0.435867  0.944511 -1.449916 -1.729965

#### How To Group by Index Level?

In [33]:
columns = pd.MultiIndex.from_arrays([['US', 'US', 'UK', 'RS', 'RS'],
                                    [1, 3, 5, 1, 3]],
                                    names=['city', 'tenor'])

hier_df = pd.DataFrame(np.random.randn(4, 5), columns=columns)
hier_df

city         US                  UK        RS
tenor         1         3         5         1         3
0      0.897737  1.585403 -0.607154  0.682949 -1.498483
1     -0.047166 -1.265283  0.834243  1.313474  0.913843
2     -0.836832  1.582702  0.975525 -0.268992 -0.917399
3      1.285261 -0.146984 -2.526453  0.667220  0.151932

In [34]:
hier_df.groupby(level='city', axis=1).count()

city  RS  UK  US
0      2   1   2
1      2   1   2
2      2   1   2
3      2   1   2

## Data Aggregation

#### Aggregations refer to any data transformation that produces scalar values from arrays.
#### Some common aggregation methods are
* count 
* sum 
* mean 
* median 
* std, var 
* min, max 
* prod 
* first, last

#### still you can find many methods, these are just to illustrate

In [35]:
book = pd.read_csv(r'dataset/books_discount.csv', encoding='latin')
book.head()

  book_name  price   author  min_dis  max_dis feedback
0       AAA    100  Author1      0.2      0.4     good
1       AAB    200  Author2      0.2      0.4  average
2       AAC    300  Author3      0.2      0.3     good
3       AAD    100  Author4      0.2      0.4     good
4       AAE    200  Author5      0.2      0.4  average

In [36]:
print(book['price'].min()); print(book['price'].max())

50
700

In [37]:
print(book['min_dis'].min()); print(book['max_dis'].min())

0.05
0.1

In [38]:
grouped = book.groupby(by=['feedback', 'author'], axis=0)

In [39]:
def max_min(arr):
    return arr.max(), arr.min()

grouped.agg(max_min)

                   book_name       price      min_dis      max_dis
feedback author
average  Author2  (AAS, AAB)  (500, 200)   (0.5, 0.1)  (0.55, 0.4)
         Author5  (AAK, AAE)  (500, 200)   (0.3, 0.2)  (0.4, 0.35)
good     Author1  (AAM, AAA)   (400, 50)   (0.3, 0.2)  (0.4, 0.35)
         Author3  (AAT, AAC)  (700, 200)  (0.3, 0.05)   (0.4, 0.1)
         Author4  (AAP, AAD)  (100, 100)   (0.3, 0.1)  (0.45, 0.3)
         Author6  (AAL, AAL)  (300, 300)   (0.4, 0.4)   (0.5, 0.5)

In [40]:
grouped.describe()

                 price                                                      \
                 count        mean         std    min    25%    50%    75%
feedback author
average  Author2   5.0  260.000000  134.164079  200.0  200.0  200.0  200.0
         Author5   2.0  350.000000  212.132034  200.0  275.0  350.0  425.0
good     Author1   3.0  183.333333  189.296945   50.0   75.0  100.0  250.0
         Author3   6.0  400.000000  200.000000  200.0  300.0  300.0  525.0
         Author4   3.0  100.000000    0.000000  100.0  100.0  100.0  100.0
         Author6   1.0  300.000000         NaN  300.0  300.0  300.0  300.0

                        min_dis            ...             max_dis            \
                    max   count      mean  ...    75%  max   count      mean
feedback author                            ...
average  Author2  500.0     5.0  0.280000  ...  0.400  0.5     5.0  0.460000
         Author5  500.0     2.0  0.250000  ...  0.275  0.3     2.0  0.375000
good     Author1  400.0     3.0  0.266667  ...  0.300  0.3     3.0  0.383333
         Author3  700.0     6.0  0.141667  ...  0.175  0.3     6.0  0.291667
         Author4  100.0     3.0  0.200000  ...  0.250  0.3     3.0  0.383333
         Author6  300.0     1.0  0.400000  ...  0.400  0.4     1.0  0.500000


                       std   min     25%    50%     75%   max
feedback author
average  Author2  0.065192  0.40  0.4000  0.450  0.5000  0.55
         Author5  0.035355  0.35  0.3625  0.375  0.3875  0.40
good     Author1  0.028868  0.35  0.3750  0.400  0.4000  0.40
         Author3  0.102062  0.10  0.3000  0.300  0.3375  0.40
         Author4  0.076376  0.30  0.3500  0.400  0.4250  0.45
         Author6       NaN  0.50  0.5000  0.500  0.5000  0.50

[6 rows x 24 columns]

#### How To Aggregate Column-wise and with Multiple Functions?

In [41]:
grouped = book.groupby(by=['feedback', 'author'])

In [42]:
grouped['price'].agg('min')

feedback  author
average   Author2    200
          Author5    200
good      Author1     50
          Author3    200
          Author4    100
          Author6    300
Name: price, dtype: int64

In [43]:
grouped['price'].agg('max')

feedback  author
average   Author2    500
          Author5    500
good      Author1    400
          Author3    700
          Author4    100
          Author6    300
Name: price, dtype: int64

In [44]:
grouped['price'].agg('mean')

feedback  author
average   Author2    260.000000
          Author5    350.000000
good      Author1    183.333333
          Author3    400.000000
          Author4    100.000000
          Author6    300.000000
Name: price, dtype: float64

In [45]:
grouped['price'].agg(['min', 'max', 'mean', 'std'])

                  min  max        mean         std
feedback author
average  Author2  200  500  260.000000  134.164079
         Author5  200  500  350.000000  212.132034
good     Author1   50  400  183.333333  189.296945
         Author3  200  700  400.000000  200.000000
         Author4  100  100  100.000000    0.000000
         Author6  300  300  300.000000         NaN

In [46]:
grouped['price'].agg([('min_value', 'min'), ('max_value', 'max'), 'mean', 'std'])

                  min_value  max_value        mean         std
feedback author
average  Author2        200        500  260.000000  134.164079
         Author5        200        500  350.000000  212.132034
good     Author1         50        400  183.333333  189.296945
         Author3        200        700  400.000000  200.000000
         Author4        100        100  100.000000    0.000000
         Author6        300        300  300.000000         NaN

In [48]:
functions = [('min_value', 'min'), ('max_value', 'max'), 'mean', 'std']
result = grouped['price', 'max_dis'].agg(functions)
result

                     price                                     max_dis  \
                 min_value max_value        mean         std min_value
feedback author
average  Author2       200       500  260.000000  134.164079      0.40
         Author5       200       500  350.000000  212.132034      0.35
good     Author1        50       400  183.333333  189.296945      0.35
         Author3       200       700  400.000000  200.000000      0.10
         Author4       100       100  100.000000    0.000000      0.30
         Author6       300       300  300.000000         NaN      0.50


                 max_value      mean       std
feedback author
average  Author2      0.55  0.460000  0.065192
         Author5      0.40  0.375000  0.035355
good     Author1      0.40  0.383333  0.028868
         Author3      0.40  0.291667  0.102062
         Author4      0.45  0.383333  0.076376
         Author6      0.50  0.500000       NaN

In [49]:
result['price']

                  min_value  max_value        mean         std
feedback author
average  Author2        200        500  260.000000  134.164079
         Author5        200        500  350.000000  212.132034
good     Author1         50        400  183.333333  189.296945
         Author3        200        700  400.000000  200.000000
         Author4        100        100  100.000000    0.000000
         Author6        300        300  300.000000         NaN

In [50]:
functions = {'min_value': 'min', 'max_value':'max', 'mean_value':'mean', 'std_value':'std'}
result = grouped['price', 'max_dis'].agg(functions)
result

                 min_value         max_value          mean_value            \
                     price max_dis     price max_dis       price   max_dis
feedback author
average  Author2       200    0.40       500    0.55  260.000000  0.460000
         Author5       200    0.35       500    0.40  350.000000  0.375000
good     Author1        50    0.35       400    0.40  183.333333  0.383333
         Author3       200    0.10       700    0.40  400.000000  0.291667
         Author4       100    0.30       100    0.45  100.000000  0.383333
         Author6       300    0.50       300    0.50  300.000000  0.500000

                   std_value
                       price   max_dis
feedback author
average  Author2  134.164079  0.065192
         Author5  212.132034  0.035355
good     Author1  189.296945  0.028868
         Author3  200.000000  0.102062
         Author4    0.000000  0.076376
         Author6         NaN       NaN

In [51]:
grouped = book.groupby(by=['feedback', 'author'], as_index=False).min()
grouped

  feedback   author book_name  price  min_dis  max_dis
0  average  Author2       AAB    200     0.10     0.40
1  average  Author5       AAE    200     0.20     0.35
2     good  Author1       AAA     50     0.20     0.35
3     good  Author3       AAC    200     0.05     0.10
4     good  Author4       AAD    100     0.10     0.30
5     good  Author6       AAL    300     0.40     0.50